# TextBox Events

---
The TextBox type exposes the following members.
| Name| Description
---|---|---
| EnterPressed| Subscribe to this event to be notified when the Enter button is pressed in the text box.
Top
#### Reference
TextBox Class
Autodesk.Revit.UI Namespace